{
  "3-electives-health-and-pe-nutrition-fitness-safety": {
    "title": "Healthy Eating, Movement, and Staying Safe",
    "summary": "Students explore the five food groups and why their bodies need different nutrients. They discover that physical activity makes them stronger and happier, and learn basic safety rules to prevent injuries at home, school, and on the playground.",
    "objectives": [
      "Understand the five food groups and why balance matters",
      "Recognize that exercise has physical, mental, and social benefits",
      "Apply basic safety rules in different environments",
      "Make healthy choices throughout the day"
    ],
    "grade_band": "3",
    "subject": "Health & PE",
    "standards": [
      "HP.NF.1.1",
      "HP.NF.1.2",
      "HP.SF.1.1"
    ],
    "outline": {
      "hook": "Ask students: 'What's your favorite food?' Create a list. Then ask: 'Which food group is each one?' Introduce: your body needs different foods for different reasons. Show images of the five food groups and ask why each matters.",
      "direct_instruction": "Teach the five groups: Fruits (vitamins, fiber), Vegetables (vitamins, minerals), Grains (energy), Protein (strength, growth), Dairy (strong bones). Explain: balance means eating from all groups. Show a plate with portions. Introduce activity: running, dancing, jumping makes your heart strong and your mood happy. Teach safety rules: look both ways before crossing, use helmets on bikes, follow playground rules, tell adults when something's wrong.",
      "guided_practice": "Sort foods into groups. Design a balanced plate with the class. Practice crossing the street safely. Discuss: what safety rule keeps you safe?",
      "independent_practice": "Keep a food diary for a day, categorizing meals. Design a healthy lunch. Practice a safety skill: helmet use, street crossing, or playground rules.",
      "check_for_understanding": "Can they name the five groups? Explain why exercise matters? List three safety rules?",
      "exit_ticket": "Students share a healthy food they like and a safety rule they'll follow.",
      "materials": [
        "Food group posters",
        "Plate diagram",
        "Helmet and safety gear examples",
        "Food pictures for sorting",
        "Activity video clips"
      ]
    }
  },
  "4-electives-health-and-pe-nutrition-fitness-safety": {
    "title": "Balanced Meals, Physical Fitness, and Wellness",
    "summary": "Students deepen their understanding of balanced meals and serving sizes. They discover different types of physical activity and their benefits. They learn to respond appropriately to injuries and recognize when to ask for adult help.",
    "objectives": [
      "Create balanced meals that include multiple food groups",
      "Understand portion sizes and hydration",
      "Identify benefits of different types of physical activity",
      "Respond appropriately to injuries and unsafe situations"
    ],
    "grade_band": "4",
    "subject": "Health & PE",
    "standards": [
      "HP.NF.2.1",
      "HP.NF.2.2",
      "HP.SF.2.1"
    ],
    "outline": {
      "hook": "Show two lunch trays: one balanced, one not. Ask: 'Which is better? Why?' Introduce: balanced meals help your body work best. Ask: 'How much cereal should you eat?' Introduce serving sizes.",
      "direct_instruction": "Explain balanced meals: multiple groups on one plate. Show serving sizes using familiar objects (fist-sized portion, handful, deck of cards). Teach hydration: water throughout the day. Introduce types of activity: cardio (running, dancing), strength (climbing, push-ups), flexibility (stretching). Explain benefits: stronger heart, better mood, good sleep, confidence. Teach injury response: wash small cuts, tell an adult about bigger issues. Discuss: when to ask for help from an adult.",
      "guided_practice": "Design a balanced meal together. Measure serving sizes. List activities and their benefits. Practice what to do if you get hurt.",
      "independent_practice": "Plan a balanced day of meals. Choose three activities and explain their benefits. Write about a time they asked an adult for help.",
      "check_for_understanding": "Can they create balanced meals? Explain serving sizes? List activity benefits? Describe injury response?",
      "exit_ticket": "Students describe a balanced meal they'd eat today.",
      "materials": [
        "Serving size reference cards",
        "Balanced meal samples",
        "Activity pictures",
        "First aid demonstration",
        "Meal planning templates"
      ]
    }
  },
  "5-electives-health-and-pe-nutrition-fitness-safety": {
    "title": "Nutrients, Physical Training, and Food Safety",
    "summary": "Students learn what nutrients do in their bodies and why variety matters. They explore aerobic and anaerobic exercise, understand flexibility and strength, and develop food safety habits to prevent illness.",
    "objectives": [
      "Understand major nutrients and their functions",
      "Distinguish between types of exercise and their benefits",
      "Apply food safety practices",
      "Recognize the importance of sleep and hydration"
    ],
    "grade_band": "5",
    "subject": "Health & PE",
    "standards": [
      "HP.NF.3.1",
      "HP.NF.3.2",
      "HP.SF.3.1"
    ],
    "outline": {
      "hook": "Ask: 'Why do athletes eat chicken before games?' Introduce nutrients: different foods have different jobs. Show: carbs give energy, protein builds muscle, fats help your brain.",
      "direct_instruction": "Explain nutrients: Carbohydrates (energy, grains and fruits), Proteins (growth, eggs and beans), Fats (hormones, nuts and fish), Vitamins (function, colorful foods), Minerals (strength, leafy greens). Introduce aerobic exercise: steady activity with oxygen (running, cycling, dancing) builds heart strength. Anaerobic: burst activity without oxygen (sprinting, jumping) builds power. Explain flexibility: stretching helps movement and prevents injury. Teach food safety: wash hands and foods, cook meat properly, refrigerate promptly, don't eat spoiled food.",
      "guided_practice": "Match foods to nutrients. Do aerobic activity (walk, dance) and anaerobic (sprint). Practice food safety: handwashing demonstration, safe food handling.",
      "independent_practice": "Analyze a meal for nutrients. Design a training day mixing aerobic and anaerobic activities. Plan food safety in the kitchen.",
      "check_for_understanding": "Can they explain nutrients? Distinguish exercise types? Describe food safety practices?",
      "exit_ticket": "Students share one nutrient and why their body needs it.",
      "materials": [
        "Nutrient charts",
        "Food labels to analyze",
        "Exercise videos (aerobic/anaerobic)",
        "Food safety posters",
        "Sleep and hydration guides"
      ]
    }
  },
  "6-electives-health-and-pe-body-systems-and-health": {
    "title": "Body Systems: How Your Body Works",
    "summary": "Students discover how major body systems function and work together to keep them alive. They learn that systems communicate through nerves and blood, and that healthy habits support all of them.",
    "objectives": [
      "Identify major body systems and their functions",
      "Understand how systems work together",
      "Explain how exercise and nutrition support body systems",
      "Apply knowledge to make health decisions"
    ],
    "grade_band": "6",
    "subject": "Health & PE",
    "standards": [
      "HP.BS.1.1",
      "HP.BS.1.2",
      "HP.HE.1.1"
    ],
    "outline": {
      "hook": "Ask: 'What happens to your body when you exercise?' Heart beats faster, breathing increases. Introduce: your body has systems working together to support this.",
      "direct_instruction": "Teach major systems: Skeletal (bones support and protect organs), Muscular (muscles move your body), Circulatory (heart and blood transport oxygen), Respiratory (lungs breathe), Digestive (breaks down food), Nervous (brain and nerves control everything). Explain: systems don't work alone—they communicate. Heart pumps blood; lungs fill it with oxygen; nerves signal when to move. Show: food → digestion → nutrients → blood → cells. Explain how habits support systems: exercise strengthens heart, balanced diet fuels all systems, sleep allows recovery.",
      "guided_practice": "Trace how oxygen moves through your body. Map what happens when you eat. Discuss: how does exercise affect each system?",
      "independent_practice": "Create a system diagram showing one system and its function. Explain how two systems work together. Write about habits that support body systems.",
      "check_for_understanding": "Can they name systems and functions? Explain how systems connect? Describe how habits help?",
      "exit_ticket": "Students describe one system and its job.",
      "materials": [
        "Body system diagrams",
        "Interactive body model",
        "System function cards",
        "Movement and breathing observation",
        "Habit impact chart"
      ]
    }
  },
  "6-electives-health-and-pe-fitness-planning": {
    "title": "Creating Your Personal Fitness Plan",
    "summary": "Students set realistic fitness goals, understand what makes them SMART, and begin designing a personal fitness plan. They learn the components of fitness and how to exercise at the right intensity.",
    "objectives": [
      "Set SMART fitness goals",
      "Understand the five components of fitness",
      "Determine appropriate exercise intensity",
      "Design a starter fitness plan with variety"
    ],
    "grade_band": "6",
    "subject": "Health & PE",
    "standards": [
      "HP.FP.1.1",
      "HP.FP.1.2",
      "HP.FP.1.3"
    ],
    "outline": {
      "hook": "Ask: 'What fitness goal do you have?' Discuss vague vs. clear goals. Show: 'Get fit' vs. 'Run a mile in 10 minutes by end of semester.' Introduce SMART framework.",
      "direct_instruction": "Teach SMART: Specific (exact goal), Measurable (can count it), Achievable (realistic for you), Relevant (you care), Time-bound (has a date). Introduce components: Cardiovascular (heart strength), Muscular Strength (power), Muscular Endurance (repeated effort), Flexibility (range of motion), Body Composition (muscle vs. fat ratio). Explain intensity: moderate (can talk but not sing) vs. high (can't talk). Teach: everyone's fitness is different; your baseline is your starting point. Show progression: gradual increases prevent injury.",
      "guided_practice": "Create SMART goals together. Explain each component. Take resting heart rate, do activity, measure heart rate change. Discuss appropriate intensity.",
      "independent_practice": "Write a SMART fitness goal. Assess their current fitness level. Design a simple weekly plan with 3-4 activities.",
      "check_for_understanding": "Can they write SMART goals? Name fitness components? Identify appropriate intensity? Design a plan?",
      "exit_ticket": "Students share their fitness goal and how they'll measure progress.",
      "materials": [
        "SMART goal template",
        "Fitness component cards",
        "Heart rate monitor or manual instructions",
        "Activity suggestions",
        "Weekly plan template"
      ]
    }
  },
  "7-electives-health-and-pe-body-systems-and-health": {
    "title": "Advanced Body Systems: Integration and Disease Prevention",
    "summary": "Students explore how body systems integrate and communicate. They learn about homeostasis, the immune system, hormones, and how lifestyle choices prevent chronic disease.",
    "objectives": [
      "Understand homeostasis and the body's stability mechanisms",
      "Explain how the immune system protects you",
      "Recognize the role of hormones and stress",
      "Identify lifestyle factors that prevent chronic disease"
    ],
    "grade_band": "7",
    "subject": "Health & PE",
    "standards": [
      "HP.BS.2.1",
      "HP.BS.2.2",
      "HP.HE.2.1"
    ],
    "outline": {
      "hook": "Ask: 'When you go from cold outside to warm inside, why do you adjust?' Introduce homeostasis: your body maintains balance (temperature, water, pH, oxygen). Ask: 'What happens when you get a cut?' Introduce immune system.",
      "direct_instruction": "Define homeostasis: constant internal state despite changing environment. Show: body adjusts temperature (sweating, shivering), water balance (thirst), oxygen (breathing changes). Explain immune system: white blood cells fight pathogens; lymph nodes filter; antibodies recognize invaders. Teach hormones: chemical messengers from endocrine glands (thyroid, pancreas, adrenals) controlling growth, metabolism, mood, reproduction. Explain stress response: helpful short-term (fight-or-flight), harmful long-term. Introduce chronic disease prevention: exercise, balanced diet, sleep, stress management, no smoking reduce disease risk.",
      "guided_practice": "Discuss how body maintains temperature. Trace immune response to a cut. Research a chronic disease and its lifestyle risk factors.",
      "independent_practice": "Create a homeostasis diagram. Explain how two body systems maintain stability. Write about lifestyle choices preventing disease.",
      "check_for_understanding": "Can they explain homeostasis? Describe immune function? Discuss hormones? List disease prevention strategies?",
      "exit_ticket": "Students share one lifestyle habit that supports long-term health.",
      "materials": [
        "Homeostasis visual",
        "Immune system diagram",
        "Hormone and gland labels",
        "Stress response chart",
        "Chronic disease prevention guide"
      ]
    }
  },
  "7-electives-health-and-pe-fitness-planning": {
    "title": "Advanced Training: Progression, Variety, and Performance",
    "summary": "Students move beyond basic fitness to periodization, understanding overtraining, and designing progressive plans. They learn to assess fitness, track progress, and adjust training systematically.",
    "objectives": [
      "Understand periodization and training cycles",
      "Assess fitness levels and identify starting points",
      "Design progressive training with appropriate recovery",
      "Track progress and adjust plans based on data"
    ],
    "grade_band": "7",
    "subject": "Health & PE",
    "standards": [
      "HP.FP.2.1",
      "HP.FP.2.2",
      "HP.FP.2.3"
    ],
    "outline": {
      "hook": "Show elite athletes: 'Do they train the same way every day?' Introduce: periodization cycles through different phases to avoid plateaus and overtraining.",
      "direct_instruction": "Define periodization: varying training to cycle through phases (build base, increase intensity, peak, recover). Explain overtraining: doing too much without recovery causes fatigue, injury, mood changes. Teach specificity: training for your goal (want speed? sprints; want strength? weights). Introduce fitness testing: baseline assessment (resting heart rate, push-ups, mile run, flexibility) shows starting point and tracks progress. Teach progression: small, steady increases prevent injury. Explain recovery: muscles repair during rest, building stronger. Discuss: listen to your body; pain isn't weakness.",
      "guided_practice": "Design a 4-week periodized plan together. Assess fitness baseline. Track a week of workouts and observe progress.",
      "independent_practice": "Assess their own fitness. Design a 4-week progressive plan with phases. Track workouts and note how they feel.",
      "check_for_understanding": "Can they explain periodization? Assess fitness? Design progressive plans? Track and adjust?",
      "exit_ticket": "Students share their baseline fitness and one training goal.",
      "materials": [
        "Fitness assessment tests",
        "Periodization template",
        "4-week training plan",
        "Workout log",
        "Progress tracking chart"
      ]
    }
  },
  "8-electives-health-and-pe-body-systems-and-health": {
    "title": "Chronic Disease, Lifestyle, and Personal Health Planning",
    "summary": "Students examine chronic diseases, understand their risk factors, and recognize that lifestyle choices today determine health outcomes. They learn to make informed decisions about sleep, stress, nutrition, and activity to prevent disease.",
    "objectives": [
      "Understand chronic disease risk factors and prevention",
      "Recognize how lifestyle choices affect long-term health",
      "Evaluate personal habits and identify improvements",
      "Create strategies for sustained wellness"
    ],
    "grade_band": "8",
    "subject": "Health & PE",
    "standards": [
      "HP.BS.3.1",
      "HP.BS.3.2",
      "HP.HE.3.1"
    ],
    "outline": {
      "hook": "Ask: 'What diseases are most common in adults?' Discuss: heart disease, diabetes, cancer. Ask: 'What habits increase risk?' Introduce: most risk factors are modifiable through lifestyle.",
      "direct_instruction": "Define chronic disease: long-lasting conditions (heart disease, diabetes, arthritis, cancer). Identify risk factors: poor diet, inactivity, smoking, stress, insufficient sleep, excessive alcohol. Explain: genetics matters, but lifestyle determines expression. Show: type 2 diabetes is largely preventable through diet and exercise. Teach stress management: chronic stress raises hormones damaging health. Discuss inflammation: acute helps healing; chronic contributes to disease. Introduce: sleep is when body repairs; deprivation increases disease risk. Emphasize: teen years matter: peak bone density now, muscles built carry forward, habits persist.",
      "guided_practice": "Analyze a disease and identify modifiable risk factors. Create a stress management plan. Assess personal sleep and activity habits.",
      "independent_practice": "Research a chronic disease. Identify personal risk factors and protective factors. Design a wellness plan addressing diet, activity, sleep, stress.",
      "check_for_understanding": "Can they explain chronic disease risk? Identify modifiable factors? Discuss teen health impact? Design wellness plans?",
      "exit_ticket": "Students share one change they'll make to improve long-term health.",
      "materials": [
        "Chronic disease profiles",
        "Risk factor charts",
        "Lifestyle impact visuals",
        "Personal health assessment",
        "Wellness planning template"
      ]
    }
  },
  "8-electives-health-and-pe-fitness-planning": {
    "title": "Lifetime Fitness: Genetics, Goals, and Sustainability",
    "summary": "Students recognize that fitness is personal and lifelong. They understand how genetics, training, nutrition, and recovery interact. They create sustainable plans aligned with their values and design strategies to maintain fitness throughout life.",
    "objectives": [
      "Understand the interaction of genetics, training, and environment",
      "Design training for specific goals (endurance, strength, overall fitness)",
      "Create sustainable fitness habits",
      "Recognize fitness's impact on mental and physical health"
    ],
    "grade_band": "8",
    "subject": "Health & PE",
    "standards": [
      "HP.FP.3.1",
      "HP.FP.3.2",
      "HP.FP.3.3"
    ],
    "outline": {
      "hook": "Ask: 'Can everyone be a marathon runner? Elite sprinter?' Discuss: genetics set potential, but effort determines outcomes. Show: genes provide range; training determines actual fitness.",
      "direct_instruction": "Explain gene-environment interaction: genetics determine potential; training determines actualization. Distinguish training: aerobic (steady, builds endurance), anaerobic (burst, builds power), strength (resistance, builds muscle). Teach nutrition's role: fuels workouts, builds muscle, enables recovery. Discuss sustainability: finding activities you enjoy, realistic goals, community support maintain long-term habits. Explain mental health benefits: exercise improves mood, reduces anxiety, builds confidence, develops resilience. Address: fitness changes across life; adjust accordingly. Emphasize: consistency beats intensity; small habits compound.",
      "guided_practice": "Design training for different goals (run faster, lift more, overall health). Analyze nutrition for training. Plan long-term fitness with life changes.",
      "independent_practice": "Assess their genetics and potential. Design a year-long plan. Identify activities they enjoy. Create sustainability strategies.",
      "check_for_understanding": "Can they explain genetics and training? Design goal-specific training? Recognize nutrition's role? Plan long-term fitness?",
      "exit_ticket": "Students share their lifetime fitness vision and first-year goal.",
      "materials": [
        "Training program templates",
        "Nutrition guide",
        "Goal progression charts",
        "Lifetime fitness planning template",
        "Habit formation strategies"
      ]
    }
  }
}