{
  "3-science-earth-and-space-earth-systems-geosphere-hydrosphere": {
    "title": "Launch Lesson: Earth And Space Earth Systems Geosphere Hydrosphere",
    "summary": "This lesson introduces Grade 3 students to earth and space earth systems geosphere hydrosphere, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space earth systems geosphere hydrosphere",
      "Students will observe and collect data related to earth and space earth systems geosphere hydrosphere",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-ESS2-1",
      "4-ESS2-1",
      "5-ESS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space earth systems geosphere hydrosphere affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space earth systems geosphere hydrosphere. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space earth systems geosphere hydrosphere. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space earth systems geosphere hydrosphere. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space earth systems geosphere hydrosphere, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space earth systems geosphere hydrosphere today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space earth systems geosphere hydrosphere",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-earth-and-space-natural-resources": {
    "title": "Launch Lesson: Earth And Space Natural Resources",
    "summary": "This lesson introduces Grade 3 students to earth and space natural resources, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space natural resources",
      "Students will observe and collect data related to earth and space natural resources",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-ESS3-1",
      "4-ESS3-1",
      "5-ESS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space natural resources affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space natural resources. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space natural resources. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space natural resources. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space natural resources, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space natural resources today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space natural resources",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-earth-and-space-solar-system-relative-scale": {
    "title": "Launch Lesson: Earth And Space Solar System Relative Scale",
    "summary": "This lesson introduces Grade 3 students to earth and space solar system relative scale, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space solar system relative scale",
      "Students will observe and collect data related to earth and space solar system relative scale",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-ESS1-1",
      "4-ESS1-1",
      "5-ESS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space solar system relative scale affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space solar system relative scale. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space solar system relative scale. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space solar system relative scale. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space solar system relative scale, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space solar system relative scale today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space solar system relative scale",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-earth-and-space-weather-and-climate": {
    "title": "Launch Lesson: Earth And Space Weather And Climate",
    "summary": "This lesson introduces Grade 3 students to earth and space weather and climate, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space weather and climate",
      "Students will observe and collect data related to earth and space weather and climate",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-ESS2-1",
      "4-ESS3-2",
      "5-ESS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space weather and climate affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space weather and climate. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space weather and climate. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space weather and climate. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space weather and climate, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space weather and climate today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space weather and climate",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-engineering-practices-criteria-and-constraints": {
    "title": "Launch Lesson: Engineering Practices Criteria And Constraints",
    "summary": "This lesson introduces Grade 3 students to engineering practices criteria and constraints, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices criteria and constraints",
      "Students will observe and collect data related to engineering practices criteria and constraints",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-ETS1-1",
      "4-ETS1-1",
      "5-ETS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices criteria and constraints affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices criteria and constraints. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices criteria and constraints. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices criteria and constraints. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices criteria and constraints, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices criteria and constraints today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices criteria and constraints",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-engineering-practices-prototypes-and-iteration": {
    "title": "Launch Lesson: Engineering Practices Prototypes And Iteration",
    "summary": "This lesson introduces Grade 3 students to engineering practices prototypes and iteration, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices prototypes and iteration",
      "Students will observe and collect data related to engineering practices prototypes and iteration",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-ETS1-2",
      "4-ETS1-2",
      "5-ETS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices prototypes and iteration affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices prototypes and iteration. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices prototypes and iteration. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices prototypes and iteration. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices prototypes and iteration, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices prototypes and iteration today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices prototypes and iteration",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-life-science-adaptations": {
    "title": "Launch Lesson: Life Science Adaptations",
    "summary": "This lesson introduces Grade 3 students to life science adaptations, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science adaptations",
      "Students will observe and collect data related to life science adaptations",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-LS4-3",
      "4-LS4-1",
      "5-LS4-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science adaptations affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science adaptations. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science adaptations. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science adaptations. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science adaptations, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science adaptations today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science adaptations",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-life-science-ecosystems-and-food-webs": {
    "title": "Launch Lesson: Life Science Ecosystems And Food Webs",
    "summary": "This lesson introduces Grade 3 students to life science ecosystems and food webs, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science ecosystems and food webs",
      "Students will observe and collect data related to life science ecosystems and food webs",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-LS2-1",
      "4-LS1-1",
      "5-LS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science ecosystems and food webs affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science ecosystems and food webs. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science ecosystems and food webs. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science ecosystems and food webs. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science ecosystems and food webs, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science ecosystems and food webs today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science ecosystems and food webs",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-life-science-heredity-intro": {
    "title": "Launch Lesson: Life Science Heredity Intro",
    "summary": "This lesson introduces Grade 3 students to life science heredity intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science heredity intro",
      "Students will observe and collect data related to life science heredity intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-LS3-1",
      "4-LS3-1",
      "5-LS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science heredity intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science heredity intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science heredity intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science heredity intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science heredity intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science heredity intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science heredity intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-life-science-human-body-systems-intro": {
    "title": "Launch Lesson: Life Science Human Body Systems Intro",
    "summary": "This lesson introduces Grade 3 students to life science human body systems intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science human body systems intro",
      "Students will observe and collect data related to life science human body systems intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-LS1-1",
      "4-LS1-1",
      "5-LS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science human body systems intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science human body systems intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science human body systems intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science human body systems intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science human body systems intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science human body systems intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science human body systems intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-physical-science-energy-transfer": {
    "title": "Launch Lesson: Physical Science Energy Transfer",
    "summary": "This lesson introduces Grade 3 students to physical science energy transfer, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science energy transfer",
      "Students will observe and collect data related to physical science energy transfer",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-PS3-1",
      "4-PS3-1",
      "5-PS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science energy transfer affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science energy transfer. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science energy transfer. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science energy transfer. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science energy transfer, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science energy transfer today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science energy transfer",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-physical-science-forces-balanced-unbalanced": {
    "title": "Launch Lesson: Physical Science Forces Balanced Unbalanced",
    "summary": "This lesson introduces Grade 3 students to physical science forces balanced unbalanced, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science forces balanced unbalanced",
      "Students will observe and collect data related to physical science forces balanced unbalanced",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-PS2-1",
      "4-PS2-1",
      "5-PS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science forces balanced unbalanced affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science forces balanced unbalanced. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science forces balanced unbalanced. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science forces balanced unbalanced. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science forces balanced unbalanced, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science forces balanced unbalanced today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science forces balanced unbalanced",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-physical-science-matter-particles": {
    "title": "Launch Lesson: Physical Science Matter Particles",
    "summary": "This lesson introduces Grade 3 students to physical science matter particles, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science matter particles",
      "Students will observe and collect data related to physical science matter particles",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-PS1-1",
      "4-PS1-1",
      "5-PS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science matter particles affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science matter particles. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science matter particles. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science matter particles. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science matter particles, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science matter particles today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science matter particles",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "3-science-physical-science-waves-intro": {
    "title": "Launch Lesson: Physical Science Waves Intro",
    "summary": "This lesson introduces Grade 3 students to physical science waves intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science waves intro",
      "Students will observe and collect data related to physical science waves intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 3",
    "subject": "Science",
    "standards": [
      "3-PS4-1",
      "4-PS4-1",
      "5-PS4-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science waves intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science waves intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science waves intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science waves intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science waves intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science waves intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science waves intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-earth-and-space-earth-systems-geosphere-hydrosphere": {
    "title": "Launch Lesson: Earth And Space Earth Systems Geosphere Hydrosphere",
    "summary": "This lesson introduces Grade 4 students to earth and space earth systems geosphere hydrosphere, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space earth systems geosphere hydrosphere",
      "Students will observe and collect data related to earth and space earth systems geosphere hydrosphere",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-ESS2-1",
      "4-ESS2-1",
      "5-ESS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space earth systems geosphere hydrosphere affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space earth systems geosphere hydrosphere. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space earth systems geosphere hydrosphere. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space earth systems geosphere hydrosphere. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space earth systems geosphere hydrosphere, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space earth systems geosphere hydrosphere today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space earth systems geosphere hydrosphere",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-earth-and-space-natural-resources": {
    "title": "Launch Lesson: Earth And Space Natural Resources",
    "summary": "This lesson introduces Grade 4 students to earth and space natural resources, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space natural resources",
      "Students will observe and collect data related to earth and space natural resources",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-ESS3-1",
      "4-ESS3-1",
      "5-ESS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space natural resources affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space natural resources. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space natural resources. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space natural resources. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space natural resources, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space natural resources today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space natural resources",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-earth-and-space-solar-system-relative-scale": {
    "title": "Launch Lesson: Earth And Space Solar System Relative Scale",
    "summary": "This lesson introduces Grade 4 students to earth and space solar system relative scale, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space solar system relative scale",
      "Students will observe and collect data related to earth and space solar system relative scale",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-ESS1-1",
      "4-ESS1-1",
      "5-ESS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space solar system relative scale affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space solar system relative scale. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space solar system relative scale. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space solar system relative scale. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space solar system relative scale, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space solar system relative scale today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space solar system relative scale",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-earth-and-space-weather-and-climate": {
    "title": "Launch Lesson: Earth And Space Weather And Climate",
    "summary": "This lesson introduces Grade 4 students to earth and space weather and climate, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space weather and climate",
      "Students will observe and collect data related to earth and space weather and climate",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-ESS2-1",
      "4-ESS3-2",
      "5-ESS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space weather and climate affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space weather and climate. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space weather and climate. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space weather and climate. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space weather and climate, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space weather and climate today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space weather and climate",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-engineering-practices-criteria-and-constraints": {
    "title": "Launch Lesson: Engineering Practices Criteria And Constraints",
    "summary": "This lesson introduces Grade 4 students to engineering practices criteria and constraints, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices criteria and constraints",
      "Students will observe and collect data related to engineering practices criteria and constraints",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-ETS1-1",
      "4-ETS1-1",
      "5-ETS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices criteria and constraints affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices criteria and constraints. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices criteria and constraints. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices criteria and constraints. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices criteria and constraints, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices criteria and constraints today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices criteria and constraints",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-engineering-practices-prototypes-and-iteration": {
    "title": "Launch Lesson: Engineering Practices Prototypes And Iteration",
    "summary": "This lesson introduces Grade 4 students to engineering practices prototypes and iteration, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices prototypes and iteration",
      "Students will observe and collect data related to engineering practices prototypes and iteration",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-ETS1-2",
      "4-ETS1-2",
      "5-ETS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices prototypes and iteration affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices prototypes and iteration. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices prototypes and iteration. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices prototypes and iteration. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices prototypes and iteration, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices prototypes and iteration today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices prototypes and iteration",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-life-science-adaptations": {
    "title": "Launch Lesson: Life Science Adaptations",
    "summary": "This lesson introduces Grade 4 students to life science adaptations, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science adaptations",
      "Students will observe and collect data related to life science adaptations",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-LS4-3",
      "4-LS4-1",
      "5-LS4-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science adaptations affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science adaptations. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science adaptations. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science adaptations. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science adaptations, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science adaptations today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science adaptations",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-life-science-ecosystems-and-food-webs": {
    "title": "Launch Lesson: Life Science Ecosystems And Food Webs",
    "summary": "This lesson introduces Grade 4 students to life science ecosystems and food webs, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science ecosystems and food webs",
      "Students will observe and collect data related to life science ecosystems and food webs",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-LS2-1",
      "4-LS1-1",
      "5-LS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science ecosystems and food webs affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science ecosystems and food webs. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science ecosystems and food webs. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science ecosystems and food webs. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science ecosystems and food webs, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science ecosystems and food webs today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science ecosystems and food webs",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-life-science-heredity-intro": {
    "title": "Launch Lesson: Life Science Heredity Intro",
    "summary": "This lesson introduces Grade 4 students to life science heredity intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science heredity intro",
      "Students will observe and collect data related to life science heredity intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-LS3-1",
      "4-LS3-1",
      "5-LS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science heredity intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science heredity intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science heredity intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science heredity intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science heredity intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science heredity intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science heredity intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-life-science-human-body-systems-intro": {
    "title": "Launch Lesson: Life Science Human Body Systems Intro",
    "summary": "This lesson introduces Grade 4 students to life science human body systems intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science human body systems intro",
      "Students will observe and collect data related to life science human body systems intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-LS1-1",
      "4-LS1-1",
      "5-LS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science human body systems intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science human body systems intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science human body systems intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science human body systems intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science human body systems intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science human body systems intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science human body systems intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-physical-science-energy-transfer": {
    "title": "Launch Lesson: Physical Science Energy Transfer",
    "summary": "This lesson introduces Grade 4 students to physical science energy transfer, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science energy transfer",
      "Students will observe and collect data related to physical science energy transfer",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-PS3-1",
      "4-PS3-1",
      "5-PS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science energy transfer affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science energy transfer. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science energy transfer. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science energy transfer. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science energy transfer, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science energy transfer today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science energy transfer",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-physical-science-forces-balanced-unbalanced": {
    "title": "Launch Lesson: Physical Science Forces Balanced Unbalanced",
    "summary": "This lesson introduces Grade 4 students to physical science forces balanced unbalanced, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science forces balanced unbalanced",
      "Students will observe and collect data related to physical science forces balanced unbalanced",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-PS2-1",
      "4-PS2-1",
      "5-PS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science forces balanced unbalanced affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science forces balanced unbalanced. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science forces balanced unbalanced. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science forces balanced unbalanced. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science forces balanced unbalanced, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science forces balanced unbalanced today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science forces balanced unbalanced",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-physical-science-matter-particles": {
    "title": "Launch Lesson: Physical Science Matter Particles",
    "summary": "This lesson introduces Grade 4 students to physical science matter particles, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science matter particles",
      "Students will observe and collect data related to physical science matter particles",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-PS1-1",
      "4-PS1-1",
      "5-PS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science matter particles affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science matter particles. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science matter particles. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science matter particles. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science matter particles, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science matter particles today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science matter particles",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "4-science-physical-science-waves-intro": {
    "title": "Launch Lesson: Physical Science Waves Intro",
    "summary": "This lesson introduces Grade 4 students to physical science waves intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science waves intro",
      "Students will observe and collect data related to physical science waves intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 4",
    "subject": "Science",
    "standards": [
      "3-PS4-1",
      "4-PS4-1",
      "5-PS4-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science waves intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science waves intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science waves intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science waves intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science waves intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science waves intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science waves intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-earth-and-space-earth-systems-geosphere-hydrosphere": {
    "title": "Launch Lesson: Earth And Space Earth Systems Geosphere Hydrosphere",
    "summary": "This lesson introduces Grade 5 students to earth and space earth systems geosphere hydrosphere, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space earth systems geosphere hydrosphere",
      "Students will observe and collect data related to earth and space earth systems geosphere hydrosphere",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-ESS2-1",
      "4-ESS2-1",
      "5-ESS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space earth systems geosphere hydrosphere affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space earth systems geosphere hydrosphere. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space earth systems geosphere hydrosphere. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space earth systems geosphere hydrosphere. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space earth systems geosphere hydrosphere, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space earth systems geosphere hydrosphere today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space earth systems geosphere hydrosphere",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-earth-and-space-natural-resources": {
    "title": "Launch Lesson: Earth And Space Natural Resources",
    "summary": "This lesson introduces Grade 5 students to earth and space natural resources, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space natural resources",
      "Students will observe and collect data related to earth and space natural resources",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-ESS3-1",
      "4-ESS3-1",
      "5-ESS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space natural resources affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space natural resources. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space natural resources. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space natural resources. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space natural resources, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space natural resources today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space natural resources",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-earth-and-space-solar-system-relative-scale": {
    "title": "Launch Lesson: Earth And Space Solar System Relative Scale",
    "summary": "This lesson introduces Grade 5 students to earth and space solar system relative scale, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space solar system relative scale",
      "Students will observe and collect data related to earth and space solar system relative scale",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-ESS1-1",
      "4-ESS1-1",
      "5-ESS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space solar system relative scale affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space solar system relative scale. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space solar system relative scale. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space solar system relative scale. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space solar system relative scale, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space solar system relative scale today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space solar system relative scale",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-earth-and-space-weather-and-climate": {
    "title": "Launch Lesson: Earth And Space Weather And Climate",
    "summary": "This lesson introduces Grade 5 students to earth and space weather and climate, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space weather and climate",
      "Students will observe and collect data related to earth and space weather and climate",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-ESS2-1",
      "4-ESS3-2",
      "5-ESS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space weather and climate affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space weather and climate. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space weather and climate. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space weather and climate. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space weather and climate, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space weather and climate today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space weather and climate",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-engineering-practices-criteria-and-constraints": {
    "title": "Launch Lesson: Engineering Practices Criteria And Constraints",
    "summary": "This lesson introduces Grade 5 students to engineering practices criteria and constraints, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices criteria and constraints",
      "Students will observe and collect data related to engineering practices criteria and constraints",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-ETS1-1",
      "4-ETS1-1",
      "5-ETS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices criteria and constraints affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices criteria and constraints. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices criteria and constraints. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices criteria and constraints. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices criteria and constraints, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices criteria and constraints today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices criteria and constraints",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-engineering-practices-prototypes-and-iteration": {
    "title": "Launch Lesson: Engineering Practices Prototypes And Iteration",
    "summary": "This lesson introduces Grade 5 students to engineering practices prototypes and iteration, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices prototypes and iteration",
      "Students will observe and collect data related to engineering practices prototypes and iteration",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-ETS1-2",
      "4-ETS1-2",
      "5-ETS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices prototypes and iteration affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices prototypes and iteration. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices prototypes and iteration. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices prototypes and iteration. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices prototypes and iteration, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices prototypes and iteration today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices prototypes and iteration",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-life-science-adaptations": {
    "title": "Launch Lesson: Life Science Adaptations",
    "summary": "This lesson introduces Grade 5 students to life science adaptations, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science adaptations",
      "Students will observe and collect data related to life science adaptations",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-LS4-3",
      "4-LS4-1",
      "5-LS4-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science adaptations affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science adaptations. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science adaptations. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science adaptations. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science adaptations, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science adaptations today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science adaptations",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-life-science-ecosystems-and-food-webs": {
    "title": "Launch Lesson: Life Science Ecosystems And Food Webs",
    "summary": "This lesson introduces Grade 5 students to life science ecosystems and food webs, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science ecosystems and food webs",
      "Students will observe and collect data related to life science ecosystems and food webs",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-LS2-1",
      "4-LS1-1",
      "5-LS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science ecosystems and food webs affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science ecosystems and food webs. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science ecosystems and food webs. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science ecosystems and food webs. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science ecosystems and food webs, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science ecosystems and food webs today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science ecosystems and food webs",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-life-science-heredity-intro": {
    "title": "Launch Lesson: Life Science Heredity Intro",
    "summary": "This lesson introduces Grade 5 students to life science heredity intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science heredity intro",
      "Students will observe and collect data related to life science heredity intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-LS3-1",
      "4-LS3-1",
      "5-LS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science heredity intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science heredity intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science heredity intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science heredity intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science heredity intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science heredity intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science heredity intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-life-science-human-body-systems-intro": {
    "title": "Launch Lesson: Life Science Human Body Systems Intro",
    "summary": "This lesson introduces Grade 5 students to life science human body systems intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science human body systems intro",
      "Students will observe and collect data related to life science human body systems intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-LS1-1",
      "4-LS1-1",
      "5-LS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science human body systems intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science human body systems intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science human body systems intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science human body systems intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science human body systems intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science human body systems intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science human body systems intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-physical-science-energy-transfer": {
    "title": "Launch Lesson: Physical Science Energy Transfer",
    "summary": "This lesson introduces Grade 5 students to physical science energy transfer, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science energy transfer",
      "Students will observe and collect data related to physical science energy transfer",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-PS3-1",
      "4-PS3-1",
      "5-PS3-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science energy transfer affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science energy transfer. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science energy transfer. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science energy transfer. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science energy transfer, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science energy transfer today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science energy transfer",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-physical-science-forces-balanced-unbalanced": {
    "title": "Launch Lesson: Physical Science Forces Balanced Unbalanced",
    "summary": "This lesson introduces Grade 5 students to physical science forces balanced unbalanced, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science forces balanced unbalanced",
      "Students will observe and collect data related to physical science forces balanced unbalanced",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-PS2-1",
      "4-PS2-1",
      "5-PS2-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science forces balanced unbalanced affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science forces balanced unbalanced. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science forces balanced unbalanced. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science forces balanced unbalanced. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science forces balanced unbalanced, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science forces balanced unbalanced today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science forces balanced unbalanced",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-physical-science-matter-particles": {
    "title": "Launch Lesson: Physical Science Matter Particles",
    "summary": "This lesson introduces Grade 5 students to physical science matter particles, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science matter particles",
      "Students will observe and collect data related to physical science matter particles",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-PS1-1",
      "4-PS1-1",
      "5-PS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science matter particles affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science matter particles. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science matter particles. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science matter particles. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science matter particles, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science matter particles today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science matter particles",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "5-science-physical-science-waves-intro": {
    "title": "Launch Lesson: Physical Science Waves Intro",
    "summary": "This lesson introduces Grade 5 students to physical science waves intro, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science waves intro",
      "Students will observe and collect data related to physical science waves intro",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 5",
    "subject": "Science",
    "standards": [
      "3-PS4-1",
      "4-PS4-1",
      "5-PS4-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science waves intro affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science waves intro. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science waves intro. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science waves intro. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science waves intro, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science waves intro today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science waves intro",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-earth-and-space-astronomy-stars-galaxies": {
    "title": "Launch Lesson: Earth And Space Astronomy Stars Galaxies",
    "summary": "This lesson introduces Grade 6 students to earth and space astronomy stars galaxies, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space astronomy stars galaxies",
      "Students will observe and collect data related to earth and space astronomy stars galaxies",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-ESS1-1",
      "MS-ESS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space astronomy stars galaxies affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space astronomy stars galaxies. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space astronomy stars galaxies. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space astronomy stars galaxies. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space astronomy stars galaxies, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space astronomy stars galaxies today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space astronomy stars galaxies",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-earth-and-space-earth-history": {
    "title": "Launch Lesson: Earth And Space Earth History",
    "summary": "This lesson introduces Grade 6 students to earth and space earth history, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space earth history",
      "Students will observe and collect data related to earth and space earth history",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-ESS1-4",
      "MS-ESS2-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space earth history affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space earth history. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space earth history. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space earth history. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space earth history, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space earth history today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space earth history",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-earth-and-space-plate-tectonics": {
    "title": "Launch Lesson: Earth And Space Plate Tectonics",
    "summary": "This lesson introduces Grade 6 students to earth and space plate tectonics, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space plate tectonics",
      "Students will observe and collect data related to earth and space plate tectonics",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-ESS2-2",
      "MS-ESS2-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space plate tectonics affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space plate tectonics. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space plate tectonics. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space plate tectonics. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space plate tectonics, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space plate tectonics today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space plate tectonics",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-earth-and-space-weather-climate-systems": {
    "title": "Launch Lesson: Earth And Space Weather Climate Systems",
    "summary": "This lesson introduces Grade 6 students to earth and space weather climate systems, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space weather climate systems",
      "Students will observe and collect data related to earth and space weather climate systems",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-ESS2-5",
      "MS-ESS2-6"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space weather climate systems affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space weather climate systems. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space weather climate systems. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space weather climate systems. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space weather climate systems, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space weather climate systems today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space weather climate systems",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-earth-space-plate-tectonics": {
    "title": "Launch Lesson: Earth Space Plate Tectonics",
    "summary": "This lesson introduces Grade 6 students to earth space plate tectonics, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth space plate tectonics",
      "Students will observe and collect data related to earth space plate tectonics",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "6-STD-001"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth space plate tectonics affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth space plate tectonics. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth space plate tectonics. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth space plate tectonics. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth space plate tectonics, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth space plate tectonics today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth space plate tectonics",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-engineering-practices-data-driven-design": {
    "title": "Launch Lesson: Engineering Practices Data Driven Design",
    "summary": "This lesson introduces Grade 6 students to engineering practices data driven design, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices data driven design",
      "Students will observe and collect data related to engineering practices data driven design",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-ETS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices data driven design affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices data driven design. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices data driven design. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices data driven design. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices data driven design, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices data driven design today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices data driven design",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-engineering-practices-modeling-and-optimization": {
    "title": "Launch Lesson: Engineering Practices Modeling And Optimization",
    "summary": "This lesson introduces Grade 6 students to engineering practices modeling and optimization, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices modeling and optimization",
      "Students will observe and collect data related to engineering practices modeling and optimization",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-ETS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices modeling and optimization affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices modeling and optimization. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices modeling and optimization. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices modeling and optimization. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices modeling and optimization, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices modeling and optimization today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices modeling and optimization",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-engineering-practices-tradeoffs-and-constraints": {
    "title": "Launch Lesson: Engineering Practices Tradeoffs And Constraints",
    "summary": "This lesson introduces Grade 6 students to engineering practices tradeoffs and constraints, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices tradeoffs and constraints",
      "Students will observe and collect data related to engineering practices tradeoffs and constraints",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-ETS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices tradeoffs and constraints affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices tradeoffs and constraints. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices tradeoffs and constraints. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices tradeoffs and constraints. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices tradeoffs and constraints, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices tradeoffs and constraints today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices tradeoffs and constraints",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-life-science-cells-and-organelles": {
    "title": "Launch Lesson: Life Science Cells And Organelles",
    "summary": "This lesson introduces Grade 6 students to life science cells and organelles, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science cells and organelles",
      "Students will observe and collect data related to life science cells and organelles",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-LS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science cells and organelles affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science cells and organelles. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science cells and organelles. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science cells and organelles. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science cells and organelles, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science cells and organelles today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science cells and organelles",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-life-science-ecology-and-biodiversity": {
    "title": "Launch Lesson: Life Science Ecology And Biodiversity",
    "summary": "This lesson introduces Grade 6 students to life science ecology and biodiversity, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science ecology and biodiversity",
      "Students will observe and collect data related to life science ecology and biodiversity",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-LS2-1",
      "MS-LS2-5"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science ecology and biodiversity affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science ecology and biodiversity. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science ecology and biodiversity. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science ecology and biodiversity. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science ecology and biodiversity, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science ecology and biodiversity today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science ecology and biodiversity",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-life-science-evolution-and-natural-selection": {
    "title": "Launch Lesson: Life Science Evolution And Natural Selection",
    "summary": "This lesson introduces Grade 6 students to life science evolution and natural selection, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science evolution and natural selection",
      "Students will observe and collect data related to life science evolution and natural selection",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-LS4-1",
      "MS-LS4-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science evolution and natural selection affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science evolution and natural selection. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science evolution and natural selection. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science evolution and natural selection. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science evolution and natural selection, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science evolution and natural selection today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science evolution and natural selection",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-life-science-genetics-and-heredity": {
    "title": "Launch Lesson: Life Science Genetics And Heredity",
    "summary": "This lesson introduces Grade 6 students to life science genetics and heredity, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science genetics and heredity",
      "Students will observe and collect data related to life science genetics and heredity",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-LS3-1",
      "MS-LS3-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science genetics and heredity affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science genetics and heredity. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science genetics and heredity. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science genetics and heredity. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science genetics and heredity, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science genetics and heredity today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science genetics and heredity",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-life-science-human-body-systems-detailed": {
    "title": "Launch Lesson: Life Science Human Body Systems Detailed",
    "summary": "This lesson introduces Grade 6 students to life science human body systems detailed, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science human body systems detailed",
      "Students will observe and collect data related to life science human body systems detailed",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-LS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science human body systems detailed affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science human body systems detailed. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science human body systems detailed. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science human body systems detailed. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science human body systems detailed, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science human body systems detailed today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science human body systems detailed",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-physical-science-chemistry-atoms-bonding-reactions": {
    "title": "Launch Lesson: Physical Science Chemistry Atoms Bonding Reactions",
    "summary": "This lesson introduces Grade 6 students to physical science chemistry atoms bonding reactions, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science chemistry atoms bonding reactions",
      "Students will observe and collect data related to physical science chemistry atoms bonding reactions",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-PS1-1",
      "MS-PS1-2",
      "MS-PS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science chemistry atoms bonding reactions affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science chemistry atoms bonding reactions. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science chemistry atoms bonding reactions. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science chemistry atoms bonding reactions. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science chemistry atoms bonding reactions, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science chemistry atoms bonding reactions today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science chemistry atoms bonding reactions",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-physical-science-energy-and-heat": {
    "title": "Launch Lesson: Physical Science Energy And Heat",
    "summary": "This lesson introduces Grade 6 students to physical science energy and heat, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science energy and heat",
      "Students will observe and collect data related to physical science energy and heat",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-PS3-3",
      "MS-PS3-4"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science energy and heat affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science energy and heat. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science energy and heat. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science energy and heat. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science energy and heat, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science energy and heat today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science energy and heat",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-physical-science-kinematics-and-forces": {
    "title": "Launch Lesson: Physical Science Kinematics And Forces",
    "summary": "This lesson introduces Grade 6 students to physical science kinematics and forces, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science kinematics and forces",
      "Students will observe and collect data related to physical science kinematics and forces",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-PS2-1",
      "MS-PS2-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science kinematics and forces affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science kinematics and forces. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science kinematics and forces. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science kinematics and forces. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science kinematics and forces, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science kinematics and forces today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science kinematics and forces",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "6-science-physical-science-waves-and-electromagnetic-spectrum": {
    "title": "Launch Lesson: Physical Science Waves And Electromagnetic Spectrum",
    "summary": "This lesson introduces Grade 6 students to physical science waves and electromagnetic spectrum, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science waves and electromagnetic spectrum",
      "Students will observe and collect data related to physical science waves and electromagnetic spectrum",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 6",
    "subject": "Science",
    "standards": [
      "MS-PS4-1",
      "MS-PS4-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science waves and electromagnetic spectrum affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science waves and electromagnetic spectrum. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science waves and electromagnetic spectrum. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science waves and electromagnetic spectrum. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science waves and electromagnetic spectrum, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science waves and electromagnetic spectrum today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science waves and electromagnetic spectrum",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-earth-and-space-astronomy-stars-galaxies": {
    "title": "Launch Lesson: Earth And Space Astronomy Stars Galaxies",
    "summary": "This lesson introduces Grade 7 students to earth and space astronomy stars galaxies, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space astronomy stars galaxies",
      "Students will observe and collect data related to earth and space astronomy stars galaxies",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-ESS1-1",
      "MS-ESS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space astronomy stars galaxies affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space astronomy stars galaxies. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space astronomy stars galaxies. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space astronomy stars galaxies. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space astronomy stars galaxies, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space astronomy stars galaxies today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space astronomy stars galaxies",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-earth-and-space-earth-history": {
    "title": "Launch Lesson: Earth And Space Earth History",
    "summary": "This lesson introduces Grade 7 students to earth and space earth history, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space earth history",
      "Students will observe and collect data related to earth and space earth history",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-ESS1-4",
      "MS-ESS2-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space earth history affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space earth history. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space earth history. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space earth history. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space earth history, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space earth history today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space earth history",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-earth-and-space-plate-tectonics": {
    "title": "Launch Lesson: Earth And Space Plate Tectonics",
    "summary": "This lesson introduces Grade 7 students to earth and space plate tectonics, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space plate tectonics",
      "Students will observe and collect data related to earth and space plate tectonics",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-ESS2-2",
      "MS-ESS2-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space plate tectonics affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space plate tectonics. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space plate tectonics. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space plate tectonics. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space plate tectonics, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space plate tectonics today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space plate tectonics",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-earth-and-space-weather-climate-systems": {
    "title": "Launch Lesson: Earth And Space Weather Climate Systems",
    "summary": "This lesson introduces Grade 7 students to earth and space weather climate systems, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space weather climate systems",
      "Students will observe and collect data related to earth and space weather climate systems",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-ESS2-5",
      "MS-ESS2-6"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space weather climate systems affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space weather climate systems. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space weather climate systems. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space weather climate systems. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space weather climate systems, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space weather climate systems today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space weather climate systems",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-engineering-practices-data-driven-design": {
    "title": "Launch Lesson: Engineering Practices Data Driven Design",
    "summary": "This lesson introduces Grade 7 students to engineering practices data driven design, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices data driven design",
      "Students will observe and collect data related to engineering practices data driven design",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-ETS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices data driven design affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices data driven design. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices data driven design. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices data driven design. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices data driven design, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices data driven design today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices data driven design",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-engineering-practices-modeling-and-optimization": {
    "title": "Launch Lesson: Engineering Practices Modeling And Optimization",
    "summary": "This lesson introduces Grade 7 students to engineering practices modeling and optimization, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices modeling and optimization",
      "Students will observe and collect data related to engineering practices modeling and optimization",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-ETS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices modeling and optimization affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices modeling and optimization. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices modeling and optimization. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices modeling and optimization. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices modeling and optimization, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices modeling and optimization today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices modeling and optimization",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-engineering-practices-tradeoffs-and-constraints": {
    "title": "Launch Lesson: Engineering Practices Tradeoffs And Constraints",
    "summary": "This lesson introduces Grade 7 students to engineering practices tradeoffs and constraints, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices tradeoffs and constraints",
      "Students will observe and collect data related to engineering practices tradeoffs and constraints",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-ETS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices tradeoffs and constraints affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices tradeoffs and constraints. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices tradeoffs and constraints. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices tradeoffs and constraints. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices tradeoffs and constraints, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices tradeoffs and constraints today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices tradeoffs and constraints",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-life-science-cells-and-organelles": {
    "title": "Launch Lesson: Life Science Cells And Organelles",
    "summary": "This lesson introduces Grade 7 students to life science cells and organelles, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science cells and organelles",
      "Students will observe and collect data related to life science cells and organelles",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-LS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science cells and organelles affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science cells and organelles. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science cells and organelles. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science cells and organelles. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science cells and organelles, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science cells and organelles today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science cells and organelles",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-life-science-ecology-and-biodiversity": {
    "title": "Launch Lesson: Life Science Ecology And Biodiversity",
    "summary": "This lesson introduces Grade 7 students to life science ecology and biodiversity, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science ecology and biodiversity",
      "Students will observe and collect data related to life science ecology and biodiversity",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-LS2-1",
      "MS-LS2-5"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science ecology and biodiversity affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science ecology and biodiversity. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science ecology and biodiversity. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science ecology and biodiversity. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science ecology and biodiversity, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science ecology and biodiversity today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science ecology and biodiversity",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-life-science-evolution-and-natural-selection": {
    "title": "Launch Lesson: Life Science Evolution And Natural Selection",
    "summary": "This lesson introduces Grade 7 students to life science evolution and natural selection, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science evolution and natural selection",
      "Students will observe and collect data related to life science evolution and natural selection",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-LS4-1",
      "MS-LS4-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science evolution and natural selection affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science evolution and natural selection. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science evolution and natural selection. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science evolution and natural selection. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science evolution and natural selection, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science evolution and natural selection today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science evolution and natural selection",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-life-science-genetics-and-heredity": {
    "title": "Launch Lesson: Life Science Genetics And Heredity",
    "summary": "This lesson introduces Grade 7 students to life science genetics and heredity, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science genetics and heredity",
      "Students will observe and collect data related to life science genetics and heredity",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-LS3-1",
      "MS-LS3-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science genetics and heredity affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science genetics and heredity. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science genetics and heredity. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science genetics and heredity. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science genetics and heredity, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science genetics and heredity today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science genetics and heredity",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-life-science-human-body-systems-detailed": {
    "title": "Launch Lesson: Life Science Human Body Systems Detailed",
    "summary": "This lesson introduces Grade 7 students to life science human body systems detailed, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science human body systems detailed",
      "Students will observe and collect data related to life science human body systems detailed",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-LS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science human body systems detailed affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science human body systems detailed. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science human body systems detailed. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science human body systems detailed. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science human body systems detailed, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science human body systems detailed today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science human body systems detailed",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-physical-science-chemistry-atoms-bonding-reactions": {
    "title": "Launch Lesson: Physical Science Chemistry Atoms Bonding Reactions",
    "summary": "This lesson introduces Grade 7 students to physical science chemistry atoms bonding reactions, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science chemistry atoms bonding reactions",
      "Students will observe and collect data related to physical science chemistry atoms bonding reactions",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-PS1-1",
      "MS-PS1-2",
      "MS-PS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science chemistry atoms bonding reactions affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science chemistry atoms bonding reactions. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science chemistry atoms bonding reactions. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science chemistry atoms bonding reactions. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science chemistry atoms bonding reactions, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science chemistry atoms bonding reactions today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science chemistry atoms bonding reactions",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-physical-science-energy-and-heat": {
    "title": "Launch Lesson: Physical Science Energy And Heat",
    "summary": "This lesson introduces Grade 7 students to physical science energy and heat, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science energy and heat",
      "Students will observe and collect data related to physical science energy and heat",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-PS3-3",
      "MS-PS3-4"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science energy and heat affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science energy and heat. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science energy and heat. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science energy and heat. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science energy and heat, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science energy and heat today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science energy and heat",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-physical-science-kinematics-and-forces": {
    "title": "Launch Lesson: Physical Science Kinematics And Forces",
    "summary": "This lesson introduces Grade 7 students to physical science kinematics and forces, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science kinematics and forces",
      "Students will observe and collect data related to physical science kinematics and forces",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-PS2-1",
      "MS-PS2-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science kinematics and forces affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science kinematics and forces. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science kinematics and forces. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science kinematics and forces. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science kinematics and forces, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science kinematics and forces today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science kinematics and forces",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "7-science-physical-science-waves-and-electromagnetic-spectrum": {
    "title": "Launch Lesson: Physical Science Waves And Electromagnetic Spectrum",
    "summary": "This lesson introduces Grade 7 students to physical science waves and electromagnetic spectrum, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science waves and electromagnetic spectrum",
      "Students will observe and collect data related to physical science waves and electromagnetic spectrum",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 7",
    "subject": "Science",
    "standards": [
      "MS-PS4-1",
      "MS-PS4-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science waves and electromagnetic spectrum affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science waves and electromagnetic spectrum. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science waves and electromagnetic spectrum. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science waves and electromagnetic spectrum. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science waves and electromagnetic spectrum, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science waves and electromagnetic spectrum today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science waves and electromagnetic spectrum",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-earth-and-space-astronomy-stars-galaxies": {
    "title": "Launch Lesson: Earth And Space Astronomy Stars Galaxies",
    "summary": "This lesson introduces Grade 8 students to earth and space astronomy stars galaxies, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space astronomy stars galaxies",
      "Students will observe and collect data related to earth and space astronomy stars galaxies",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-ESS1-1",
      "MS-ESS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space astronomy stars galaxies affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space astronomy stars galaxies. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space astronomy stars galaxies. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space astronomy stars galaxies. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space astronomy stars galaxies, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space astronomy stars galaxies today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space astronomy stars galaxies",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-earth-and-space-earth-history": {
    "title": "Launch Lesson: Earth And Space Earth History",
    "summary": "This lesson introduces Grade 8 students to earth and space earth history, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space earth history",
      "Students will observe and collect data related to earth and space earth history",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-ESS1-4",
      "MS-ESS2-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space earth history affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space earth history. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space earth history. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space earth history. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space earth history, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space earth history today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space earth history",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-earth-and-space-plate-tectonics": {
    "title": "Launch Lesson: Earth And Space Plate Tectonics",
    "summary": "This lesson introduces Grade 8 students to earth and space plate tectonics, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space plate tectonics",
      "Students will observe and collect data related to earth and space plate tectonics",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-ESS2-2",
      "MS-ESS2-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space plate tectonics affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space plate tectonics. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space plate tectonics. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space plate tectonics. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space plate tectonics, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space plate tectonics today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space plate tectonics",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-earth-and-space-weather-climate-systems": {
    "title": "Launch Lesson: Earth And Space Weather Climate Systems",
    "summary": "This lesson introduces Grade 8 students to earth and space weather climate systems, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of earth and space weather climate systems",
      "Students will observe and collect data related to earth and space weather climate systems",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-ESS2-5",
      "MS-ESS2-6"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does earth and space weather climate systems affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to earth and space weather climate systems. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to earth and space weather climate systems. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from earth and space weather climate systems. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about earth and space weather climate systems, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about earth and space weather climate systems today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to earth and space weather climate systems",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-engineering-practices-data-driven-design": {
    "title": "Launch Lesson: Engineering Practices Data Driven Design",
    "summary": "This lesson introduces Grade 8 students to engineering practices data driven design, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices data driven design",
      "Students will observe and collect data related to engineering practices data driven design",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-ETS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices data driven design affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices data driven design. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices data driven design. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices data driven design. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices data driven design, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices data driven design today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices data driven design",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-engineering-practices-modeling-and-optimization": {
    "title": "Launch Lesson: Engineering Practices Modeling And Optimization",
    "summary": "This lesson introduces Grade 8 students to engineering practices modeling and optimization, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices modeling and optimization",
      "Students will observe and collect data related to engineering practices modeling and optimization",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-ETS1-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices modeling and optimization affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices modeling and optimization. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices modeling and optimization. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices modeling and optimization. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices modeling and optimization, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices modeling and optimization today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices modeling and optimization",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-engineering-practices-tradeoffs-and-constraints": {
    "title": "Launch Lesson: Engineering Practices Tradeoffs And Constraints",
    "summary": "This lesson introduces Grade 8 students to engineering practices tradeoffs and constraints, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of engineering practices tradeoffs and constraints",
      "Students will observe and collect data related to engineering practices tradeoffs and constraints",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-ETS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does engineering practices tradeoffs and constraints affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to engineering practices tradeoffs and constraints. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to engineering practices tradeoffs and constraints. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from engineering practices tradeoffs and constraints. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about engineering practices tradeoffs and constraints, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about engineering practices tradeoffs and constraints today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to engineering practices tradeoffs and constraints",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-life-science-cells-and-organelles": {
    "title": "Launch Lesson: Life Science Cells And Organelles",
    "summary": "This lesson introduces Grade 8 students to life science cells and organelles, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science cells and organelles",
      "Students will observe and collect data related to life science cells and organelles",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-LS1-1"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science cells and organelles affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science cells and organelles. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science cells and organelles. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science cells and organelles. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science cells and organelles, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science cells and organelles today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science cells and organelles",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-life-science-ecology-and-biodiversity": {
    "title": "Launch Lesson: Life Science Ecology And Biodiversity",
    "summary": "This lesson introduces Grade 8 students to life science ecology and biodiversity, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science ecology and biodiversity",
      "Students will observe and collect data related to life science ecology and biodiversity",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-LS2-1",
      "MS-LS2-5"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science ecology and biodiversity affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science ecology and biodiversity. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science ecology and biodiversity. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science ecology and biodiversity. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science ecology and biodiversity, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science ecology and biodiversity today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science ecology and biodiversity",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-life-science-evolution-and-natural-selection": {
    "title": "Launch Lesson: Life Science Evolution And Natural Selection",
    "summary": "This lesson introduces Grade 8 students to life science evolution and natural selection, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science evolution and natural selection",
      "Students will observe and collect data related to life science evolution and natural selection",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-LS4-1",
      "MS-LS4-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science evolution and natural selection affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science evolution and natural selection. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science evolution and natural selection. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science evolution and natural selection. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science evolution and natural selection, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science evolution and natural selection today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science evolution and natural selection",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-life-science-genetics-and-heredity": {
    "title": "Launch Lesson: Life Science Genetics And Heredity",
    "summary": "This lesson introduces Grade 8 students to life science genetics and heredity, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science genetics and heredity",
      "Students will observe and collect data related to life science genetics and heredity",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-LS3-1",
      "MS-LS3-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science genetics and heredity affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science genetics and heredity. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science genetics and heredity. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science genetics and heredity. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science genetics and heredity, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science genetics and heredity today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science genetics and heredity",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-life-science-human-body-systems-detailed": {
    "title": "Launch Lesson: Life Science Human Body Systems Detailed",
    "summary": "This lesson introduces Grade 8 students to life science human body systems detailed, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of life science human body systems detailed",
      "Students will observe and collect data related to life science human body systems detailed",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-LS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does life science human body systems detailed affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to life science human body systems detailed. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to life science human body systems detailed. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from life science human body systems detailed. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about life science human body systems detailed, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about life science human body systems detailed today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to life science human body systems detailed",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-physical-science-chemistry-atoms-bonding-reactions": {
    "title": "Launch Lesson: Physical Science Chemistry Atoms Bonding Reactions",
    "summary": "This lesson introduces Grade 8 students to physical science chemistry atoms bonding reactions, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science chemistry atoms bonding reactions",
      "Students will observe and collect data related to physical science chemistry atoms bonding reactions",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-PS1-1",
      "MS-PS1-2",
      "MS-PS1-3"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science chemistry atoms bonding reactions affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science chemistry atoms bonding reactions. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science chemistry atoms bonding reactions. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science chemistry atoms bonding reactions. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science chemistry atoms bonding reactions, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science chemistry atoms bonding reactions today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science chemistry atoms bonding reactions",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-physical-science-energy-and-heat": {
    "title": "Launch Lesson: Physical Science Energy And Heat",
    "summary": "This lesson introduces Grade 8 students to physical science energy and heat, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science energy and heat",
      "Students will observe and collect data related to physical science energy and heat",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-PS3-3",
      "MS-PS3-4"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science energy and heat affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science energy and heat. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science energy and heat. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science energy and heat. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science energy and heat, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science energy and heat today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science energy and heat",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-physical-science-kinematics-and-forces": {
    "title": "Launch Lesson: Physical Science Kinematics And Forces",
    "summary": "This lesson introduces Grade 8 students to physical science kinematics and forces, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science kinematics and forces",
      "Students will observe and collect data related to physical science kinematics and forces",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-PS2-1",
      "MS-PS2-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science kinematics and forces affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science kinematics and forces. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science kinematics and forces. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science kinematics and forces. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science kinematics and forces, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science kinematics and forces today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science kinematics and forces",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  },
  "8-science-physical-science-waves-and-electromagnetic-spectrum": {
    "title": "Launch Lesson: Physical Science Waves And Electromagnetic Spectrum",
    "summary": "This lesson introduces Grade 8 students to physical science waves and electromagnetic spectrum, focusing on key concepts and observable phenomena.",
    "objectives": [
      "Students will understand fundamental concepts of physical science waves and electromagnetic spectrum",
      "Students will observe and collect data related to physical science waves and electromagnetic spectrum",
      "Students will apply learning to new scenarios"
    ],
    "grade_band": "Grade 8",
    "subject": "Science",
    "standards": [
      "MS-PS4-1",
      "MS-PS4-2"
    ],
    "outline": {
      "hook": "Start with an engaging phenomenon or question: 'How does physical science waves and electromagnetic spectrum affect your daily life?' Show students a relevant video clip or image that sparks curiosity about the topic.",
      "direct_instruction": "Explain key terms and concepts related to physical science waves and electromagnetic spectrum. Use visual aids and demonstrations. Have students take notes on important vocabulary and examples. Connect new learning to prior knowledge.",
      "guided_practice": "Work with students on a structured investigation or problem related to physical science waves and electromagnetic spectrum. Provide guiding questions and allow students to make observations, predictions, and collect data with teacher support.",
      "independent_practice": "Students complete worksheets or activities independently that apply the concepts from physical science waves and electromagnetic spectrum. They may design simple experiments, answer analysis questions, or create visual representations of learning.",
      "check_for_understanding": "Use quick formative assessments: ask think-pair-share questions about physical science waves and electromagnetic spectrum, have students complete exit tickets, or conduct brief individual conferences to identify misconceptions.",
      "exit_ticket": "Students answer: 'What is one key thing you learned about physical science waves and electromagnetic spectrum today? How could you use this knowledge?'",
      "materials": [
        "Classroom materials related to physical science waves and electromagnetic spectrum",
        "Chart paper and markers",
        "Science notebooks for note-taking",
        "Visual aids and diagrams",
        "Safety equipment if needed"
      ]
    }
  }
}